//GETPGASM JOB 1,NOTIFY=&SYSUID,MSGLEVEL=(1,1)
//ASM      EXEC ASMACL,MBR=GETPGM
//C.SYSIN  DD  DSN=&SYSUID..GET.SOURCE(GETPGM),DISP=SHR
//SYSLMOD  DD  DSN=&SYSUID..LOAD,DISP=SHR
